greetings = """Привіт {username}👋
Я бот, що покликаний врятувати тебе від великої кількості неприємностей!
Ти забуваєш про важливі події та про дні народження своїх близьких?
Я візьму цю работу на себе і нагадую заздалегіть, щоб ти нічого не забув :)
Почни працювати зі мною, використовуючи меню нижче 🔽"""


check_new_event = """
Дякую, за цю інформацію. Перевір, будь ласка, чи я все правильно запам'ятав?
Назва події: {event_name};
Повторюваність події: {event_recurring}; 
Дата події: {event_date};
Частота події: {event_freq}.
"""